Repository: van8tka/RepeatingWords2
Catalog: RepeatingWords/RepeatingWords/Resource.*.resx
Languages: ru

# ButtonAddDict
source: Create dictionary
ru: Добавить словарь

# ButtonAddDictionaryOrWords
source: Dictionaries
ru: Словари

# ButtonAddWord
source: Create word
ru: Добавить слово

# ButtonAddWorFrFile
source: Import words from the file
ru: Загрузить слова из файла

# ButtonCreate
source: Create
ru: Создать

# ButtonHowCreateDictAndaddWord
source: Create the dictionary
ru: Создание словаря

# ButtonHowIportFile
source: Import words from the file
ru: Импорт слов из файла

# ButtonNextWord
source: Next card
ru: Следующее слово

# ButtonRemove
source: Remove the dictionary
ru: Удалить словарь

# ButtonRepeatWords
source: Studying of words
ru: Изучение слов

# ButtonTurnCard
source: Turn the card
ru: Перевернуть карточку

# ChooseDictionaryForRepeat
source: Learning
ru: Изучение

source: Continue
ru: Продолжить

# EntryNameDict
source: Enter the dictionary name
ru: Введите название словаря

# HeaderMain
source: Use these cards of words for a learning of foreign language
ru: Используйте карточки для изучения иностранных слов и их повторения.

# HowUseApp
source: Help
ru: Помощь

# LabelChooseDict
source: Select the dictionary
ru: Выберите словарь

# LabelChooseDictOrCreate
source: Select or create dictionary
ru: Выберите словарь или создайте новый

# LabelChooseFile
source: Select the file to import
ru: Выберите файл для загрузки в словарь

# LabelFirstWord
source: Enter the native word
ru: Введите слово на русском

# LabelForStart
source: To get started with the application, you need: Add your dictionary with words and add words individually, add a dictionary from the Internet by selecting the language you want, or add words to the dictionary from the file.
ru: Для начала работы с приложением необходимо: добавить свой словарь со словами и добавлять слова по отдельности или добавить словарь из интернета выбрав нужный язык или добавить слова в словарь из файла.

# LabelHeadAddFile
source: Add words from file
ru: Добавление слов из файла

# LabelHeadCreateInstr
source: Create the dictionary and add the word
ru: Создание словаря и добавление слов

# LabelInstruction
source: Instructions of the app
ru: Инструкция по использованию программы

# LabelNameDict
source: Enter the dictionary name
ru: Введите название нового словаря

# LabelNeedAddFile
source: You need for import words from the file:
ru: Для начала работы с программой необходимо: добавить свой словарь со словами и добавлять слова по отдельности, добавить словарь из сервера выбрав нужный язык, или добавить слова в словарь из файла.

# LabelNeedCreate
source: Use Notepad.exe create the file with ".txt" format on the computer
ru: Для добавления слов из файла необходимо создать на компьютере, ипользуя программу Блокнот(Notepad) файл c расширением ".txt"

# LabelPathToRoot
source: Path to file:
ru: Путь к файлу:

# LabelScreen1
source: To add your dictionary, click [DICTIONARIES]
ru: Для добавления своего словаря необходимо нажать [СЛОВАРИ]

# LabelScreen2
source: Then click [CREATE DICTIONARY]
ru: Нажимаем [ДОБАВИТЬ СЛОВАРЬ]

# LabelScreen21
source: Fill the file as in example: word [transcription] translate. You have to use [ ] in every line.
ru: Заполнить файл словами в следующем порядке: слово, транскрипция, перевод. Обязательно транскрипция в центре строки для разделения русского слова и его перевода, и обязательно использование квадратных скобок!

# LabelScreen22
source: You have to save file in UTF-8.
ru: Далее при сохранении файла указать кодировку UTF-8.

# LabelScreen231
source: Load this file into the phone.
ru: Скопировать созданный файл на телефон в любое удобное место.

# LabelScreen232
source: Select dictionary and select [Import words from the file] in context menu
ru: Запустить приложение на телефоне, выбрать словарь и выбрать [Загрузить слова из файла]

# LabelScreen24
source: Find and select file on smartphone. Wait while import words will be complete.
ru: Указываем путь к файлу и нажимаем на файл

# LabelScreen25
source: After that shows the list of words.
ru: Когда слова загрузятся в словарь, откроется окно со списком слов.

# LabelScreen3
source: Enter the name of the dictionary and click the [CREATE]
ru: Ввести название словаря и нажать кнопку [СОЗДАТЬ]

# LabelScreen4
source: Click on the created dictionary
ru: Нажать на созданный словарь

# LabelScreen5
source: Select [Create word]
ru: Выбрать [Добавить слово]

# LabelScreen6
source: Enter the word, translate of the word and transcription.Click [Create word]
ru: Ввести слово, перевод, транскрипцию(не обязательно) и нажмите кнопку [Добавить слово]

# LabelScreen7
source: When you click on the transcription input field, you can select a keyboard smartphone or keyboard transcription
ru: При нажатии на поле ввода транскрипции можно выбрать клавиатуру смартфона или клавиатуру транскрипции

# LabelScreen8
source: After adding words click on the created dictionary and select [View the list of words]
ru: После добавления слов нажимаем на созданный словарь и выбираем [Просмотр списка слов]

# LabelScreen9
source: Where you can also add words (1), go to the study of words (2)
ru: Где так же можно добавлять слова(1) или перейти к изучению слов (2)

# LabelSecondWord
source: Enter the translation of the word
ru: Введите перевод слова

# LabelTranscription
source: Enter the transcription of the word
ru: Введите транскрипцию

# TitleMain
source: Cards of words
ru: Карточки слов

# ModalActCancel
source: Cancel
ru: Отмена

# ModalActChange
source: Change
ru: Изменить

# ModalActFromFtoTr
source: From the first language
ru: С родного языка на иностранный

# ModalActFromTrtoF
source: Is foreign words display first?
ru: Первым отображать иностранное слово?

# ModalAddWords
source: The words are added.
ru: Слова добавлены в словарь

# ModalAllWordsComplete
source: All words are passed
ru: Пройдены все слова

# ModalChooceAction
source: Select the action:
ru: Выберите действие над словом:

# ModalChooseLang
source: Select display language:
ru: Выберите отображение языка карточки:

# ModalDict
source: The dictionary
ru: Словарь

# ModalException
source: Exception
ru: Ошибка

# ModalFinish
source: Finish
ru: Закончить

# ModalIncorrectFile
source: Words aren't added to the dictionary, perhaps incorrect file.
ru: Слова недобавлены в словарь, возможно некорректный файл

# ModalNoWord
source: The dictionary doesn't have words.
ru: Словарь не содержит слов

# ModalRemove
source: is deleted.
ru: удален.

# ModalRemoveAct
source: Delete
ru: Удалить

# ModalRestart
source: Restart
ru: Начать заново

# ModalWord
source: The word
ru: Слово

# ModalWordRemove
source: is deleted.
ru: удалено.

# ModelForAddingWord
source: For adding of the word fill all fields (except a transcription).
ru: Для добавления слова обязательно введите русское значение и перевод(транскрипция не обязательна).

# ModelNoFillFull
source: Not all fields are filled
ru: Не все поля заполнены

# ModelWordAdd
source: The word is added!
ru: Слово добавлено!

# ModelWordChange
source: The word is changed!
ru: Слово изменено!

# ModalDictOrWordRemove
source: The dictionary or word was deleted!
ru: Словарь или слово удалено!

# ButtonShowWords
source: View the list of words
ru: Просмотр списка слов

# PickerText
source: Voice language
ru: Язык озвучки

# ButtonAddWorFrNet
source: Add dictionary from the server
ru: Добавить словарь из интернета

# ModalCheckNet
source: Check internet connection
ru: Проверьте наличие интернет соединения

# LabelDictionaryListFromNet
source: Select the dictionary for load into the phone
ru: Выберите словарь для загрузки в память телефона

# LabelLanguageListFromNet
source: Choose language
ru: Выберите язык для изучения

# ButtonReviewText
source: Write a review
ru: Оставить отзыв

# LabelCountTurned
source: Turned:
ru: Перевернутых:

# ModalLerningTurnedWords
source: Studying of unlearned words
ru: Изучение перевернутых слов

# LabelChooseTheme
source: Choose theme
ru: Выберите тему

# LabelThemeDark
source: Dark
ru: Темная

# LabelThemeLight
source: Light
ru: Светлая

# LabelSettings
source: Settings
ru: Настройки

# ButtonPolicy
source: Privacy
ru: Приватность

# ButtonAbout
source: About app
ru: О приложении

# LabelFIO
source: Ivan Kuzmuk
ru: Иван Кузьмук

# LabelRights
source: All rights reserved.
ru: Все права защищены.

# LabelChooseShowKeyboardTrans
source: Suggest keyboard for transcription
ru: Предлагать клавиатуру для ввода транскрипции

# LabelShowKeyboard
source: Suggest
ru: Предлагать

# ModalActChooseKeyboard
source: Select the keyboard:
ru: Выберите клавиатуру:

# ModalActSysKeyboard
source: System keyboard
ru: Клавиатура системы

# ModalActTranscKeyboard
source: Transcription keyboard
ru: Клавиатура транскрипции

# ModalActList
source: List of words
ru: Список слов

# ButtonSendReview
source: Leave a comment
ru: Оставить отзыв

# MessagePleaseReview
source: Please leave the comment about application, your judgement is very important for us.
ru: Пожалуйста оставьте свой отзыв о приложении, Ваше мнение очень важно для нас.

# ModelNoFillFullNameDictionary
source: Enter name of the dictionary
ru: Введите название словаря

# BackUpCreateBtn
source: Create a backup
ru: Создать резервную копию

# BackUpCreateLocal
source: Save backup in the local memory
ru: Создание резервной копии в памяти телефона

# BackUpErrorCreated
source: An error occurred while creating the backup
ru: Во время создания резервной копии произошла ошибка

# BackUpErrorRestored
source: An error occurred, the backup is not restored
ru: Произошла ошибка, резервная копия не восстановлена

# BackUpGoogleDrive
source: Save backup in Google Drive
ru: Создание резервной копии на Google диск

# BackUpInLocal
source: In the local memory
ru: В памяти телефона

source: Backup method
ru: Выберите способ создания резервной копии

# BackUpOnGoogle
source: On Google Drive
ru: На Google диск

# BackUpRestoreBtn
source: Restore a backup
ru: Восстановить резервную копию

source: Backup restored
ru: Резервная копия восстановлена

# BackUpSearch
source: Search a backup
ru: Поиск резервной копии

# BackupStr
source: Backup
ru: Резервное копирование

# BackupWasCreatedGoogle
source: The backup was created successfully
ru: Резервная копия создана успешно

# BackupWasCreatedInFolder
source: The backup was created in the directory
ru: Резервная копия создана в дирректории

# SuccessStr
source: Success
ru: Успешно

# screen1
source: screen1.jpg
ru: screen1ru.jpg

# screen10
source: screen10.jpg
ru: screen10ru.jpg

# screen11
source: screen11.jpg
ru: screen11ru.jpg

# screen12
source: screen12.jpg
ru: screen12ru.jpg

# screen2
source: screen2.jpg
ru: screen2ru.jpg

# screen3
source: screen3.jpg
ru: screen3ru.jpg

# screen4
source: screen4.jpg
ru: screen4ru.jpg

# screen5
source: screen5.jpg
ru: screen5ru.jpg

# screen6
source: screen6.jpg
ru: screen6ru.jpg

# screen7
source: screen7.jpg
ru: screen7ru.jpg

# screen8
source: screen8.jpg
ru: screen8ru.jpg

# screen9
source: screen9.jpg
ru: screen9ru.jpg

# LabelScreen10
source: You can also change the word or delete it by calling the context menu by clicking on the word
ru: Так же можно изменить слово или удалить его вызвав контекстное меню нажатием на слово

# LabelScreen11
source: Click the [STUDING OF WORDS] button will open the context menu for selecting the learning language
ru: При нажатии на кнопку [ИЗУЧЕНИЕ СЛОВ] откроется контекстное меню выбора языка изучения

# LabelScreen12
source: After selecting the language, a study window appears, where the figures show: the total number of words / words displayed / inverted words
ru: Выбрав язык отобразиться окно изучения, где цифрами показано: общее кол-во слов/показанных слов/перевернутых слов

# screen20
source: screen20.jpg
ru: screen20ru.jpg

# screen21
source: screen21.jpg
ru: screen21ru.jpg

# screen22
source: screen22.jpg
ru: screen22ru.jpg

# screen23
source: screen23.jpg
ru: screen23ru.jpg

# screen24
source: screen24.jpg
ru: screen24ru.jpg

# NotLearningPostfics
source: - not learned words
ru: - перевернутые карточки

# TitleAbout
source: About
ru: О приложении

# TitleHelpAddWord
source: How to add words
ru: Как добавить слова

# TitleHelpers
source: Help
ru: Помощь

# TitleHelpImportFile
source: How to import words
ru: Как импортировать слова

# TitleSettings
source: Settings
ru: Настройки

# TitleDictionaries
source: Dictionaries
ru: Словари

# TitleLanguages
source: Languages
ru: Выбор языка

# TitleChangeWord
source: Change the word
ru: Изменить слово

# TitleCreateWord
source: Create a word
ru: Создать слово

# TitleTranscription
source: Transcription
ru: Транскрипция

# ButtonImport
source: Import
ru: Импорт

# TitleExplorer
source: File explorer
ru: Файловый менеджер

source: No
ru: Нет

source: Yes
ru: Да

# AllWordsCountLabel
source: All:
ru: Всего:

# OpenedWordsCountLabel
source: Opened:
ru: Открытых:

# ShowedWordsCountLabel
source: Showed:
ru: Показанных:

# TitleVolumeLanguages
source: Select a voice language
ru: Выберите язык озвучки

# ButtonCheck
source: ✓ проверить
ru: ✓ check

# ButtonHint
source: ? подсказать
ru: ? hint

# EnterAnswer
source: Введите ответ
ru: Enter answer

# ButtonSave
source: Save
ru: Сохранить

# ModalUpdateApp
source: A new version of the application is available.Do you want to upgrade app?
ru: Доступна новая версия приложения. Хотите обновить?

# WaitIndicator
source: Loading..
ru: Загрузка..

# ModalFinishWords
source: Congratulations! You looked at all the words.
ru: Поздравляю! Слова закончились.
